stm32-rs/stm32f3xx-hal/src/pwm.rs
impl<arr> ClocksToArrAndPsc for ExactArrAndPsc<arr> {
    type Arr = arr;

    fn timer_freq_to_arr_and_psc(self, timer_freq: u32) -> ExactArrAndPsc<Self::Arr> {
        self
    }
}

pub struct ResAndFreq<r> {
    resolution: r,
    frequency: Hertz,
}

impl<arr: Into<u32>> ClocksToArrAndPsc for ResAndFreq<arr> {
    type Arr = arr;

    fn timer_freq_to_arr_and_psc(self, timer_freq: u32) -> ExactArrAndPsc<Self::Arr> {
        // calculate the pre-scaler
        let prescale_factor = timer_freq / self.resolution.into() / self.frequency.0;
        ExactArrAndPsc {
            arr: self.resolution,
            psc: prescale_factor as u16 - 1,
        }
    }
}

// Picks the greatest resolution that yields a reasonably approximate frequency.
// In many cases (the higher the frequency), the frequency will be exact or have
// maximum possible accuracy regardless (as not all frequencies _can_ be
// perfectly expressed).
// Error is bounded by: `(Fi + m * Fo + 2 Fo) / ((m - 2) * (Fi + Fo))` where
// Fi is the input clock frequency
// Fo is the output clock frequency
// m is the maximum resolution
//
// Example:
//   - Fi = 72MHz
//   - Fo = 50Hz
//   - Max Resolution = 2^16 (standard timer)
//
// Then:
//   - Worst Case Error ~= 0.00146%
//   - Worst Case Frequency ~= 50.000728Hz
//   - Actual Error ~= 0.000833%
//   - Actual Frequency ~= 50.0004167Hz
//
// From:
// `Fi / Fo = (a - 1) * m + Rm` such that `Rm >= 0`, and `Rm < m`
// `Fi / Fo = b * a + Ra` such that `Ra >= 0`, and `Ra < a`
// `b <= m`
//
// `Fi / Fo = b * a + Ra`
// Worst case Ra = (a - 1)
//
// `Fi / Fo = b * a + (a - 1)`
// `Fi / Fo - (a - 1) = b * a`
// `Fi / Fo - a + 1 = b * a`
// `(Fi / Fo - a + 1) / a = b`
// `(Fi / Fo - a + 1) / a <= m`
// `Fi / Fo - a + 1 <= m * a`
// `Fi / Fo + 1 <= m * a - a`
// `Fi / Fo + 1 <= a * (m - 1)`
// `(Fi / Fo + 1) / (m - 1) <= a`
//
// error:
// (Fo - (Fi / (b * a))) / Fo
// (Fo - (Fi / (Fi / Fo - Ra))) / Fo
//
// Worst case Ra = (a - 1)
// (Fo - (Fi / (Fi / Fo - (a - 1)))) / Fo
//
// worst case a = (Fi / Fo + 1) / (m - 1)
// (Fo - (Fi / (Fi / Fo - ((Fi / Fo + 1) / (m - 1) - 1)))) / Fo
//
// simplified:
// (Fi + m * Fo + 2 Fo) / ((m - 2) * (Fi + Fo))
pub struct PrioritizeResolution<r> {
    resolution: PhantomData<r>,
    frequency: Hertz,
}

impl ClocksToArrAndPsc for PrioritizeResolution<u16> {
    type Arr = u16;

    fn timer_freq_to_arr_and_psc(self, timer_freq: u32) -> ExactArrAndPsc<Self::Arr> {
        // calculate the pre-scaler
        // We need the resolution * prescale factor to equal the total_scaling
        let total_scaling = timer_freq / self.frequency.0;
        // We find the smallest factor that will result in the other factor
        // being less than 2^16.
        let prescale_factor =
            total_scaling / 2 ^ 16 + if total_scaling % 2 ^ 16 == 0 { 1 } else { 0 };
        // Given the smallest factor, we can now find its complement
        // Together, the two give an error bounded approximate of the total
        // scaling target.
        let resolution = total_scaling / prescale_factor;
        ExactArrAndPsc {
            arr: (resolution - 1) as u16,
            psc: (prescale_factor - 1) as u16,
        }
    }
}

impl ClocksToArrAndPsc for PrioritizeResolution<u32> {
    type Arr = u32;

    fn timer_freq_to_arr_and_psc(self, timer_freq: u32) -> ExactArrAndPsc<Self::Arr> {
        // A high-resolution timer will always have enough bits to divide out even to the lowest
        // frequency for the Hertz type (1hz).
        ExactArrAndPsc {
            arr: (timer_freq / self.frequency.0) - 1,
            psc: 1,
        }
    }
}

macro_rules! pwm_timer_private {
    ($timx:ident, $TIMx:ty, $res:ty, $apbxenr:ident, $apbxrstr:ident, $pclkz:ident, $timxrst:ident, $timxen:ident, $enable_break_timer:expr, [$($TIMx_CHy:ident),+], [$($x:ident),+]) => {
        /// Create one or more output channels from a TIM Peripheral
        /// This function requires the maximum resolution of the duty cycle,
        /// the period of the PWM signal and the frozen clock configuration.
        ///
        /// The resolution should be chosen to offer sufficient steps against
        /// your target peripheral.  For example, a servo that can turn from
        /// 0 degrees (2% duty cycle) to 180 degrees (4% duty cycle) might choose
        /// a resolution of 9000.  This allows the servo to be set in increments
        /// of exactly one degree.
        #[allow(unused_parens)]
        pub fn $timx<cc: ClocksToArrAndPsc<Arr = $res>>(tim: $TIMx, clock_config: cc, clocks: &Clocks) -> ($(PwmChannel<$TIMx_CHy, NoPins>),+) {
            // Power the timer and reset it to ensure a clean state
            // We use unsafe here to abstract away this implementation detail
            // Justification: It is safe because only scopes with mutable references
            // to TIMx should ever modify this bit.
            unsafe {
                (*RCC::ptr()).$apbxenr.modify(|_, w| w.$timxen().set_bit());
                (*RCC::ptr()).$apbxrstr.modify(|_, w| w.$timxrst().set_bit());
                (*RCC::ptr()).$apbxrstr.modify(|_, w| w.$timxrst().clear_bit());
            }

            // enable auto reload preloader
            tim.cr1.modify(|_, w| w.arpe().set_bit());

            // TODO: This is repeated in the timer/pwm module.
            // It might make sense to move into the clocks as a crate-only property.
            // TODO: ppre1 is used in timer.rs (never ppre2), should this be dynamic?
            let clock_freq = clocks.$pclkz().0 * if clocks.ppre1() == 1 { 1 } else { 2 };
            let ExactArrAndPsc { arr, psc } : ExactArrAndPsc<$res> = clock_config.timer_freq_to_arr_and_psc(clock_freq);

            // Set the "resolution" of the duty cycle (ticks before restarting at 0)
            // Oddly this is unsafe for some timers and not others
            //
            // NOTE(write): not all timers are documented in stm32f3, thus marked unsafe.
            // This write uses all bits of this register so there are no unknown side effects.
            #[allow(unused_unsafe)]
            tim.arr.write(|w| unsafe {
                w.arr().bits(arr)
            });

            // Set the pre-scaler
            // NOTE(write): uses all bits of this register.
            tim.psc.write(|w| w.psc().bits(psc));

